#if 0

* 사용자 임의대로 재구성이 가능하다.

리눅스 커널이 F/OSS 에 속하여 있으므로 소스 코드를 원하는 대로 수정할 수 있다.
그러나 License 부분을 조심해야 한다.

* 열약한 환경에서도 HW 자원을 적절히 활용하여 동작한다.

리눅스 커널이 가볍고 좋을뿐만 아니라 소스가 공개되어 있어
다양한 분야의 사람들이 지속적으로 개발하여 어떠한 열약한 환경에서도 잘 동작한다.

* 커널의 크기가 작다.

최적화가 잘 되어 있다는 뜻

* 완벽한 멀티유저, 멀티태스킹 시스템

리눅스는 RT Scheduling 방식을 채택하여 Multi-Tasking 을 효율적으로 잘 해낸다.

* 뛰어난 안정성

전 세계의 많은 개발자들이 지속적으로 유지보수하여 안정성이 뛰어남

* 빠른 업그레이드

위와 같음

* 강력한 네트워크 지원

TCP/IP Stack 이 원채 잘 되어 있다보니 Router 및 Switch 등의 장비에서 사용함

* 풍부한 소프트웨어

GNU(GNU is Not Unix) 정신에 입각하여 많은 Tool 들이 개발되어 있다.

#endif
